---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToReplaceSelectedGroups
source: html/29ac9abb-1a09-545a-3889-1369dc513768.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToReplaceSelectedGroups Property

Unable to change the types of the groups you have selected and the related groups. You might try deleting the groups you wish
 to change and placing or copy/pasting new groups of the desired type.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToReplaceSelectedGroups { get; }
```